:- initialization(main).

print_list([]) :- write('\n').
print_list([X|Xs]) :- write(X), write(', '), print_list(Xs).

'чоловік'('Дмитро').
'чоловік'('Гамлет').
'чоловік'('Іван').
'чоловік'('Марко').
'чоловік'('Ніл').
'чоловік'('Андрій').
'чоловік'('Федір').
'чоловік'('Роман').

'жінка'('Тетяна').
'жінка'('Валерія').
'жінка'('Ганна').
'жінка'('Федора').
'жінка'('Євгенія').
'жінка'('Діна').
'жінка'('Людмила').

'родитель'('Дмитро', 'Іван').
'родитель'('Дмитро', 'Марко').
'родитель'('Гамлет', 'Ганна').
'родитель'('Гамлет', 'Федора').
'родитель'('Тетяна', 'Іван').
'родитель'('Тетяна', 'Марко').
'родитель'('Валерія', 'Ганна').
'родитель'('Валерія', 'Федора').
'родитель'('Іван', 'Андрій').
'родитель'('Іван', 'Федір').
'родитель'('Ганна', 'Андрій').
'родитель'('Ганна', 'Федір').
'родитель'('Ніл', 'Діна').
'родитель'('Євгенія', 'Діна').
'родитель'('Андрій', 'Людмила').
'родитель'('Андрій', 'Роман').
'родитель'('Діна', 'Людмила').
'родитель'('Діна', 'Роман').

'батько'(X, Y) :-
    'родитель'(X, Y),
    'чоловік'(X).

'мати'(X, Y) :-
    'родитель'(X, Y),
    'жінка'(X).

'син'(X, Y) :-
    'родитель'(Y, X),
    'чоловік'(X).

'дочка'(X, Y) :-
    'родитель'(Y, X),
    'жінка'(X).

'брат'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Parent, Y),
    'чоловік'(X),
    X \= Y.

'сестра'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Parent, Y),
    'жінка'(X),
    X \= Y.

'дядько'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Parent, Sibling),
    'родитель'(Sibling, Y),
    'чоловік'(X),
    X \= Y.

'тітка'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Parent, Sibling),
    'родитель'(Sibling, Y),
    'жінка'(X),
    X \= Sibling.

'дід'(X, Y) :-
    'родитель'(X, Child),
    'родитель'(Child, Y),
    'чоловік'(X).

'баба'(X, Y) :-
    'родитель'(X, Child),
    'родитель'(Child, Y),
    'жінка'(X).

'онук'(X, Y) :-
    'родитель'(Y, Parent),
    'родитель'(Parent, X),
    'чоловік'(X).

'онучка'(X, Y) :-
    'родитель'(Y, Parent),
    'родитель'(Parent, X),
    'жінка'(X).

'небіж'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Grandparent, Parent),
    'родитель'(Grandparent, Y),
    'чоловік'(X),
    Y \= Parent.

'небога'(X, Y) :-
    'родитель'(Parent, X),
    'родитель'(Grandparent, Parent),
    'родитель'(Grandparent, Y),
    'жінка'(X),
    Y \= Parent.

'одружені'(X, Y) :-
    'родитель'(X, Child),
    'родитель'(Y, Child),
    X \= Y.

'теща'(X, Y) :-
    'родитель'(Y, Child),
    'родитель'(Wife, Child),
    'родитель'(X, Wife),
    'жінка'(X),
    'чоловік'(Y),
    Y \= Wife.

'тесть'(X, Y) :-
    'родитель'(Y, Child),
    'родитель'(Wife, Child),
    'родитель'(X, Wife),
    'чоловік'(X),
    'чоловік'(Y),
    Y \= Wife.

'свекруха'(X, Y) :-
    'родитель'(Husband, Child),
    'родитель'(Y, Child),
    'родитель'(X, Husband),
    'жінка'(X),
    'жінка'(Y),
    Y \= Husband.

'свекор'(X, Y) :-
    'родитель'(Husband, Child),
    'родитель'(Y, Child),
    'родитель'(X, Husband),
    'чоловік'(X),
    'жінка'(Y),
    Y \= Husband.

'зять'(X, Y) :-
    'родитель'(X, Child),
    'родитель'(Wife, Child),
    'родитель'(Y, Wife),
    'чоловік'(X),
    X \= Wife.

'невістка'(X, Y) :-
    'родитель'(X, Child),
    'родитель'(Husband, Child),
    'родитель'(Y, Husband),
    'жінка'(X),
    X \= Husband.

'свояк'(X, Y) :-
    'родитель'(Y, Child),
    'родитель'(Wife, Child),
    'родитель'(Wife_parent, Wife),
    'родитель'(Wife_parent, Wife_sister),
    'родитель'(Wife_sister, Wife_sister_child),
    'родитель'(X, Wife_sister_child),
    'жінка'(Wife_sister),
    'чоловік'(X),
    'чоловік'(Y),
    Wife \= Wife_sister,
    Y \= Wife.

'своячка'(X, Y) :-
    'родитель'(Y, Child),
    'родитель'(Wife, Child),
    'родитель'(Wife_parent, Wife),
    'родитель'(Wife_parent, X),
    'жінка'(X),
    'чоловік'(Y),
    X \= Wife,
    Y \= Wife.

'дівер'(X, Y) :-
    'родитель'(Husband, Child),
    'родитель'(Y, Child),
    'родитель'(Husband_parent, Husband),
    'родитель'(Husband_parent, X),
    'чоловік'(X),
    'жінка'(Y),
    X \= Husband,
    Y \= Husband.

'внучатий небіж'(X, Y) :-
    'родитель'(Parent, Y),
    'родитель'(Parent, Sibling),
    'родитель'(Sibling, Sibling_child),
    'родитель'(Sibling_child, X),
    'чоловік'(X),
    Y \= Sibling.
    

'внучата небога'(X, Y) :-
    'родитель'(Parent, Y),
    'родитель'(Parent, Sibling),
    'родитель'(Sibling, Sibling_child),
    'родитель'(Sibling_child, X),
    'жінка'(X),
    Y \= Sibling.

parent_with_parents(X) :- 'родитель'(_, X), 'родитель'(X, _).

without_children(X) :- 'родитель'(_, X), \+ 'родитель'(X, _).

main :-
    findall([X, Y], 'онук'(X, Y), Res),
    %maplist(sort, Res),
    sort(Res),
    print_list(Res).

    %findall(X, parent_with_parents(X), Task_1_result),
    %sort(Task_1_result),
    %print_list(Task_1_result),
    
    %findall(X, without_children(X), Task_2_result),
    %sort(Task_2_result),
    %print_list(Task_2_result).
